[NoCoverage] BlockStatement
src/codigo/Database.js:2:34
 // Función que utiliza la base de datos
-const createUser = (db, user) => {
-    db.addUser (user);
-    return user;
-  }
+const createUser = (db, user) => {}
 const getUser = (db, id)  => {
     return db.getUser_ById(id);

[NoCoverage] BlockStatement
src/codigo/Database.js:6:30
     db.addUser (user);
     return user;
   }
-const getUser = (db, id)  => {
-    return db.getUser_ById(id);
-  }
+const getUser = (db, id)  => {}
 
 module.exports = { createUser , getUser};

[NoCoverage] ObjectLiteral
src/codigo/Database.js:10:18
     return db.getUser_ById(id);
   }
 
-module.exports = { createUser , getUser};
+module.exports = {};
