[Killed] BlockStatement
src/codigo/Mensaje.js:2:40
 // Función que envía un mensaje a un usuario
-const sendMessage = (user, message) => {
-    console.log(`Enviando mensaje a ${user.name}: ${message}`);
-    return { 'msg' : 'Mensaje enviado'}
-  }
+const sendMessage = (user, message) => {}
   
 // Función que utiliza sendMessage
killedBy: Pruebas de MUTACION sendMessage debe retornar el objeto correcto
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"msg": "Mensaje enviado"}
Received: undefined

[Killed] StringLiteral
src/codigo/Mensaje.js:3:17
 // Función que envía un mensaje a un usuario
 const sendMessage = (user, message) => {
-    console.log(`Enviando mensaje a ${user.name}: ${message}`);
+    console.log(``);
     return { 'msg' : 'Mensaje enviado'}
   }
killedBy: Pruebas de MUTACION sendMessage debe imprimir el mensaje correcto en consola
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Enviando mensaje a Martita: Saludos"
Received: ""

Number of calls: 1

[Killed] StringLiteral
src/codigo/Mensaje.js:4:22
 // Función que envía un mensaje a un usuario
 const sendMessage = (user, message) => {
     console.log(`Enviando mensaje a ${user.name}: ${message}`);
-    return { 'msg' : 'Mensaje enviado'}
+    return { 'msg' : ""}
   }
   
killedBy: Pruebas de MUTACION sendMessage debe retornar el objeto correcto
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "msg": "Mensaje enviado",
+   "msg": "",

[Survived] BlockStatement
src/codigo/Mensaje.js:8:41
   }
   
 // Función que utiliza sendMessage
-const notifyUser  = (user, message)  => {
-    sendMessage(user, message);
-  }
+const notifyUser  = (user, message)  => {}
 
   module.exports = { sendMessage , notifyUser };
